from indusnlp.cleaner import TextCleaner


config = [
("remove_line_with_pattern", [r".*\{.*?\}"]),
("remove_line_with_pattern", [r"^.*हिन्दुस्तान टीम.*$",r"^.*संवाददाता.*$",r"^.*Updated.*$" ]),
("remove_line_and_before", ["- फोटो :"]),
("remove_line_and_below", ["Next Article"]),
(
    "remove_line_with_keyword",
    [
        "हिन्दुस्तान अखबार", "ऐप पर पढ़ें","लाइव हिन्दुस्तान","Hindi News",
        "hindi news", "अगला लेख पढ़ें", "दी गई जानकारियों", "हिन्दुस्तान टीम"
        "Updated", "Published by", "Link Copied",
        "Follow Us", "Next Article", "Followed", 
        "अमर उजाला,", "News in Hindi", "Hindi news",
        "सब्सक्राइब करें", "डाउनलोड करें", "सब्सक्रिप्शन",
        "Disclaimer", "एड फ्री अनुभव", "Get all Sports",
        "ब्यूरो", "ब्यूरो,", "Get all India News", "Read the latest",
        "हम डाटा संग्रह टूल्स", "लेटेस्ट अपडेट्स", 
    ],
),
("handle_whitespace", None),
("remove_single_word_lines", None),
("remove_redundant_lines", None),
("remove_blank_lines", None),
]

txt = '''
{"_id":"6042c5bd8ebc3e59047611c4","slug":"delhi-news-special-story-on-womens-day","type":"feature-story","status":"publish","title_hn":"महिला दिवस पर खास : मां...दीदी तो कई ने दिया है देवी का दर्जा","category":{"title":"City & states","title_hn":"शहर और राज्य","slug":"city-and-states"}}
महिला दिवस पर खास : मां...दीदी तो कई ने दिया है देवी का दर्जा
राजीव कुमार, नई दिल्ली
Published by: दुष्यंत शर्मा
Updated Sat, 06 Mar 2021 05:29 AM IST
सुकन्या, सीमा और मुकेशी, यह किसी के लिए मां हैं तो किसी के लिए दीदी। कुछ ने तो इनको देवी तक का दर्जा दे रखा है। हो भी क्यों न, परिवार से बिछड़े छोटे छोटे बच्चों को जो इनने उनके पापा-मम्मी से मिला दिया है। घर जाने के बाद भी बच्चे इनको भुला नहीं सके हैं।
अन्तरराष्ट्रीय महिला दिवस पर बात दिल्ली पुलिस की तीन सेनानियों की है, जिन्होंने भूले बिसरे बच्चों को उनके परिवार तक पहुंचाने में मदद की है। इसके लिए तीनों ने नौकरी से बाहर जाते हुए निजी दिलचस्पी दिखाई है। इसके बदौलत करीब चार सौ से ज्यादा बच्चों को घर का रास्ता दिखाया है।
सुकन्या: 360 परिवारों की लौटाई खुशियां
दिल्ली पुलिस की क्राइम ब्रांच में तैनात सिपाही सुकन्या में एक गजब जुनून है। दिल्ली से किसी भी परिवार के गायब हुए बच्चों की जानकारी मिलते ही वह सक्रिय हो जाती हैं और तब तक उन्हें सकून नहीं मिलता जब तक कि बच्चा अपने परिवार तक नहीं पहुंच जाता। बच्चों की तलाशने में वह दिन और रात की चिंता नहीं करती हैं। सुकन्या बताती है कि गायब हुए बच्चों को तलाशना इतना आसान नहीं है। लेकिन आला अधिकारियों की देखरेख में इस काम को आसान कर देती है। सुराग-दर-सुराग को तलाशते हुए उनतक पहुंच जाती है।
इसका परिणाम यह है कि आज वह दिल्ली के करीब 360 परिवारों को उनकी खुशियां लौटा चुकी हैं। जिन माता-पिता को उनका लाडला मिला है वह परिवार उन्हें देवी तक मान चुके हैं। दिल्ली पुलिस के अधिकारी जहां इनके काम की तारीफ कर इनका हौसला अफजाई करते हैं वहीं परिवार भी पूरी तौर पर इनके काम में सहयोग देते हैं। सुकन्या बताती हैं कि बच्चों की तलाश के दौरान उनसे वह भावनात्मक रूप से जुड़ गई है, जिनके परिवार वाले अकसर मिलते जुलते रहते हैं।
मुकेशी: कलेजे का टुकड़ा पाने पर परिवार देता है दुआ
मुकेशी
- फोटो : amar ujala
दिल्ली मेट्रो में तैनात सिपाही मुकेशी बताती हैं कि उनके लिए सकुन का पल तब होता है जब वह किसी परिवार के दिल के टूकड़े को उनसे मिलवाती है। परिवार उन्हें दिल से दुआ देता है। आमतौर पर परिवार से बिछड़े बच्चों को ढूंढने का कार्य आसान नहीं होता। खासतौर पर ऐसे बच्चे जिनका लोकेशन की सटीक जानकारी नहीं हो, ऐसे बच्चे को ढूंढना भूसे की ढेर में सुई तलाशने जैसा होता है। लेकिन पीड़ित परिवार के भरोसे और पुलिस अधिकारियों की सहयोग से कार्य आसान हो जाता है।
मुकेशी बताती है कि उसकी बेटी जब एक साल की हुई तब से उसे दौरे पड़ते हैं। अपने बच्चे का दुखदर्द ही उनके लिए प्रेरणा का काम किया और वह अब कई परिवारों से दुआ ले रही हैं। मुकेशी बताती है कि इस काम के लिए उनके पति और परिवार की सदस्य प्रेरित करते हैं और उसके बाद वह इसके लिए दिन रात एक कर देती है। इस वर्ष जनवरी माह से उन्होंने 16 बच्चों को उनके परिवार को सौंप चुकी है।
सीमा: बच्चों को तलाशने के बाद मिलती है खुशी
हवलदार सीमा
- फोटो : amar ujala
मेट्रो पुलिस में तैनात हवलदार सीमा बताती हैं कि एक परिवार का बच्चा जब बिछड़ जाता है तो परिवार पूरी तरह से टूट जाता है। ऐसे में वह यह अपेक्षा करता है कि कोई करिश्मा हो और उसका बच्चा वापस मिल जाए। हम मिशन समझकर बच्चे की तलाश करते हैं, तो असंभव भी संभव हो जाता है। बच्चे के मिलने पर जैसी खुशी परिवार वालों को होती है, वैसी खुशी उन्हें भी मिलती है। परिवार उन्हें इस सच्चे काम के लिए आर्शीवाद देता है।
सीमा बताती है कि इस अभियान में वरिष्ठ अधिकारियों का पूरा सहयोग रहता है, जिसकी बदौलत वह अब तक 53 बच्चों को उनके परिवार से मिलवा चुकी है। बच्चों को तलाशने में अनुमान और एक साक्ष्य से दूसरे साक्ष्य का मिलाना काफी महत्वपूर्ण होता है तभी बिछड़े बच्चों तक पहुंच पाना संभव है। इस काम में परिवार वाले भी उन्हें पूरा सहयोग करते हैं।
एड फ्री अनुभव के लिए अमर उजाला प्रीमियम सब्सक्राइब करें
अतिरिक्त ₹50 छूट सालाना सब्सक्रिप्शन पर
Next Article
Disclaimer
हम डाटा संग्रह टूल्स, जैसे की कुकीज के माध्यम से आपकी जानकारी एकत्र करते हैं ताकि आपको बेहतर और व्यक्तिगत अनुभव प्रदान कर सकें और लक्षित विज्ञापन पेश कर सकें। अगर आप साइन-अप करते हैं, तो हम आपका ईमेल पता, फोन नंबर और अन्य विवरण पूरी तरह सुरक्षित तरीके से स्टोर करते हैं। आप कुकीज नीति पृष्ठ से अपनी कुकीज हटा सकते है और रजिस्टर्ड यूजर अपने प्रोफाइल पेज से अपना व्यक्तिगत डाटा हटा या एक्सपोर्ट कर सकते हैं। हमारी Cookies Policy, Privacy Policy और Terms & Conditions के बारे में पढ़ें और अपनी सहमति देने के लिए Agree पर क्लिक करें।
Read the latest and breaking Hindi news on amarujala.com. Get live Hindi news about India and the World from politics, sports, bollywood, business, cities, lifestyle, astrology, spirituality, jobs and much more. Register with amarujala.com to get all the latest Hindi news updates as they happen.
'''

textcleaner = TextCleaner(config)

cleaned_text = textcleaner.run(txt)
print(cleaned_text)
