from indusnlp.cleaner import TextCleaner


config = [
("remove_after_keyword", ["Post Views:"]),
("handle_whitespace", None),
("remove_single_word_lines", None),
("remove_redundant_lines", None),
("remove_blank_lines", None),
]

txt = '''
स्थानीय दिल्ली प्रदेश कांग्रेस कमेटी की पूर्व अध्यक्षा श्रीमति ताजदार बाबर नहीं रहीं Sunil Kumar October 2, 2021 Delhi News नई दिल्ली। आज (2 अक्टूबर 2021) सुबह 2 अक्टूबर को दिल्ली प्रदेश कांग्रेस कमेटी की पूर्व अध्यक्षा श्रीमति ताजदार बाबर के दुखत निधन पर दिल्ली प्रदेश कांग्रेस कमेटी के अध्यक्ष चौ. अनिल कुमार ने खेद जताया। उन्होंने श्रीमति ताजदार बाबर के निवास स्थान ईस्ट निजामुद्दीन पर उनके पार्थिव शरीर को अखिल भारतीय कांग्रेस कमेटी के पूर्व अध्यक्ष श्री राहुल गांधी जी के साथ पुष्पांजलि अर्पित आर्पित की।
चौ. अनिल कुमार ने कहा कि जंहा एक ओर कांग्रेस पार्टी गांधी जयन्ती मना रहीं है वहीं दूसरी ओर कांग्रेस पार्टी ने अपनी बहुमूल्य नेता, दिल्ली प्रदेश कांग्रेस कमेटी की पूर्व अध्यक्षा श्रीमति ताजदार बाबर को खो दिया है। आज सुबह दिनांक 2 अक्टूबर को उनका इन्तेकाल हो गया है। उन्होंने बताया कि श्रीमति ताजदार बाबर कांग्रेस पार्टी की रीड़ की हड्डी ही नहीं बल्कि कांग्रेस कार्यकर्ताओं की ताकत भी थी। उन्होंने कहा की श्रीमति ताजदार बाबर ने अपने जीवन पर्यन्त कांग्रेस पार्टी को अपना भरपूर अतुल्य योगदान दिया, श्रीमति ताजदार बाबर 1984 से लेकर 1988 तक दिल्ली प्रदेश कांग्रेस कमेटी की अध्यक्षा भी रही। उन्होंने कहा कि कांग्रेस पार्टी उनके द्वारा दिए गए योगदान को कांग्रेस पार्टी कभी नहीं भूल पाएंगी और कांग्रेस पार्टी में उनकी कमी हमेशा बनी रहेगी।
चौ. अनिल कुमार ने श्रीमति ताजदार बाबर के परिवार वालों से प्रार्थना की थी कि वें श्रीमति तजदर बाबर जी के पार्थिव शारीर को दिल्ली प्रदेश कांग्रेस कार्यालय राजीव भवन में कांग्रेस कार्यकर्ताओं के लिए अन्तिम दर्शन व पुष्पांपजलि अर्पित करने के लिए रखा जाए, परन्तु समय के अभाव के कारण उनके पार्थिव शरीर को कांग्रेस कार्यालय में नहीं रखा जा सका। दिल्ली प्रदेश कांग्रेस कमेटी अध्यक्ष चौ. अनिल कुमार ने कहा कि बाद में श्रीमति ताजदार बाबर की शोक सभा रखी जाऐगी। Post Views: 218
'''

textcleaner = TextCleaner(config)

cleaned_text = textcleaner.run(txt)
print(cleaned_text)
